In [1]:
import pandas as pd

# membaca dataset dan store ke dataframe
sample = pd.read_csv("marvel_stats.csv")
# print
sample

              nama     type   atk   def  times_used
0         Iron Man   Attack  2000  1000        3900
1           Antman  Special  1500   950        2900
2             Hulk   Attack  2550  1200        3300
3        Spiderman  Balance  1500   890        2400
4      Dr. Strange  Support   900  1400        3000
5  Captain America  Defense   850  2000        2950
6             Thor   Attack  2200  1300        3150

In [2]:
# head() menampilkan 5 records pertama
sample.head()

          nama     type   atk   def  times_used
0     Iron Man   Attack  2000  1000        3900
1       Antman  Special  1500   950        2900
2         Hulk   Attack  2550  1200        3300
3    Spiderman  Balance  1500   890        2400
4  Dr. Strange  Support   900  1400        3000

In [3]:
# head() menampilkan 2 records pertama
sample.head(2)

       nama     type   atk   def  times_used
0  Iron Man   Attack  2000  1000        3900
1    Antman  Special  1500   950        2900

In [4]:
# tail() menampilkan 5 records terakhir
sample.tail()

              nama     type   atk   def  times_used
2             Hulk   Attack  2550  1200        3300
3        Spiderman  Balance  1500   890        2400
4      Dr. Strange  Support   900  1400        3000
5  Captain America  Defense   850  2000        2950
6             Thor   Attack  2200  1300        3150

In [5]:
# tail() menampilkan 3 records terakhir
sample.tail(3)

              nama     type   atk   def  times_used
4      Dr. Strange  Support   900  1400        3000
5  Captain America  Defense   850  2000        2950
6             Thor   Attack  2200  1300        3150

In [6]:
# menampilkan jumlah baris pada kolom DataFrame
sample.shape

(7, 5)

In [7]:
# menampilkan rata-rata
sample.mean(numeric_only=True)

atk           1642.857143
def           1248.571429
times_used    3085.714286
dtype: float64

In [8]:
# Median menampilkan nilai tengah
sample.median(numeric_only=True)

atk           1500.0
def           1200.0
times_used    3000.0
dtype: float64

In [9]:
# Standar deviasi
sample.std(numeric_only=True)

atk           643.187746
def           381.244828
times_used    455.260260
dtype: float64

In [10]:
# Menampilkan nilai tertinggi
sample.max()

nama             Thor
type          Support
atk              2550
def              2000
times_used       3900
dtype: object

In [11]:
# Menampilkan nilai terendah
sample.min()

nama          Antman
type          Attack
atk              850
def              890
times_used      2400
dtype: object

In [12]:
# Jumlah non null setiap kolom
sample.count()

nama          7
type          7
atk           7
def           7
times_used    7
dtype: int64

In [13]:
# Ringkasan statistik data
sample.describe()

               atk          def   times_used
count     7.000000     7.000000     7.000000
mean   1642.857143  1248.571429  3085.714286
std     643.187746   381.244828   455.260260
min     850.000000   890.000000  2400.000000
25%    1200.000000   975.000000  2925.000000
50%    1500.000000  1200.000000  3000.000000
75%    2100.000000  1350.000000  3225.000000
max    2550.000000  2000.000000  3900.000000

In [14]:
# rename kolom
sample = sample.rename(columns={'nama':'Nama_Heroes'})
sample

       Nama_Heroes     type   atk   def  times_used
0         Iron Man   Attack  2000  1000        3900
1           Antman  Special  1500   950        2900
2             Hulk   Attack  2550  1200        3300
3        Spiderman  Balance  1500   890        2400
4      Dr. Strange  Support   900  1400        3000
5  Captain America  Defense   850  2000        2950
6             Thor   Attack  2200  1300        3150

In [15]:
# Drop atau menghilangkan kolom
sample = sample.drop(columns=['times_used'])

In [16]:
# menampilkan record 1 kolom (atk yang berada di indeks ke-2)
sample.iloc[:,2]

0    2000
1    1500
2    2550
3    1500
4     900
5     850
6    2200
Name: atk, dtype: int64

In [17]:
# menampilkan 3 record pertama dari 1 kolom (atk)
sample.iloc[0:3,2]

0    2000
1    1500
2    2550
Name: atk, dtype: int64

In [18]:
# Tampilkan kembali semua baris dan kolom
sample.iloc[:,:]

       Nama_Heroes     type   atk   def
0         Iron Man   Attack  2000  1000
1           Antman  Special  1500   950
2             Hulk   Attack  2550  1200
3        Spiderman  Balance  1500   890
4      Dr. Strange  Support   900  1400
5  Captain America  Defense   850  2000
6             Thor   Attack  2200  1300

In [19]:
# menampilkan data dari record ke 3 dan kolom ke 2
sample.iloc[3:,2:]

    atk   def
3  1500   890
4   900  1400
5   850  2000
6  2200  1300

# loc

In [20]:
# menampilkan record 1 kolom, dengan menulis nama kolomnya(Nama_Heroes)
sample.loc[:, "Nama_Heroes"]

0           Iron Man
1             Antman
2               Hulk
3          Spiderman
4        Dr. Strange
5    Captain America
6               Thor
Name: Nama_Heroes, dtype: object

In [21]:
# menampilkan record dari indeks ke 0 sampai ke 3 dari kolom "Nama_Heroes"
sample.loc[0:3, "Nama_Heroes"]

0     Iron Man
1       Antman
2         Hulk
3    Spiderman
Name: Nama_Heroes, dtype: object

In [22]:
# menampilkan record dari indeks ke-3 dari kolom Nama_Heroes sampai type
sample.loc[:3, "Nama_Heroes":"type"]

  Nama_Heroes     type
0    Iron Man   Attack
1      Antman  Special
2        Hulk   Attack
3   Spiderman  Balance

In [23]:
# mengisi nilai 1 untuk semua kolom "times_used"
sample['times_used']=1
sample

       Nama_Heroes     type   atk   def  times_used
0         Iron Man   Attack  2000  1000           1
1           Antman  Special  1500   950           1
2             Hulk   Attack  2550  1200           1
3        Spiderman  Balance  1500   890           1
4      Dr. Strange  Support   900  1400           1
5  Captain America  Defense   850  2000           1
6             Thor   Attack  2200  1300           1

# Sorting

In [24]:
# sorting berdasarkan ascending dari kolom "atk"
sample.sort_values(by='atk')

       Nama_Heroes     type   atk   def  times_used
5  Captain America  Defense   850  2000           1
4      Dr. Strange  Support   900  1400           1
1           Antman  Special  1500   950           1
3        Spiderman  Balance  1500   890           1
0         Iron Man   Attack  2000  1000           1
6             Thor   Attack  2200  1300           1
2             Hulk   Attack  2550  1200           1

In [25]:
# sorting berdasarkan descending dari kolom "atk"
sample.sort_values(by='atk', ascending=False)

       Nama_Heroes     type   atk   def  times_used
2             Hulk   Attack  2550  1200           1
6             Thor   Attack  2200  1300           1
0         Iron Man   Attack  2000  1000           1
1           Antman  Special  1500   950           1
3        Spiderman  Balance  1500   890           1
4      Dr. Strange  Support   900  1400           1
5  Captain America  Defense   850  2000           1

# Filter

In [26]:
# filter record yang "atknya" lebih dari 1500 dan akan menampilkan True atau False
sample['atk'] > 1500

0     True
1    False
2     True
3    False
4    False
5    False
6     True
Name: atk, dtype: bool

In [27]:
# filter kemudian tampilkan record nya
filter1 = sample['atk'] > 1500
filterbaru = sample[filter1]
filterbaru

  Nama_Heroes    type   atk   def  times_used
0    Iron Man  Attack  2000  1000           1
2        Hulk  Attack  2550  1200           1
6        Thor  Attack  2200  1300           1

In [28]:
# filter kemudian tampilkan record nya (def kurang dari 1000 dan bertipe balance)
filter2 = (sample['def'] < 1000) & (sample['type'] == 'Balance')
filterbaru2 = sample[filter2]
filterbaru2

  Nama_Heroes     type   atk  def  times_used
3   Spiderman  Balance  1500  890           1